{
    "app": {
        "title": "Machine Learning Libre",
        "welcome": "¡Bienvenido! 🎓",
        "description": "Esta aplicación proporciona visualizaciones interactivas para comprender conceptos de machine learning. Utiliza el menú lateral para navegar por las secciones.",
        "available_sections": "Secciones disponibles:",
        "navigation": "Navegación",
        "language": "Idioma"
    },
    "perceptron": {
        "title": "El perceptrón",
        "description": "El perceptrón es un concepto clave, pues las redes neuronales modernas utilizan este elemento como bloque de construcción. \n\n Se trata de una neurona capaz de hacer una clasificación binaria en base a una regresión lineal y una función de activación.",
        "info_linear_regression": "Es importante que ya conozcas la regresión lineal, puedes verla en este mismo proyecto.",
        "equations_title": "Ecuación del perceptrón",
        "perceptron_eq_desc_p1": "El perceptrón clasifica un punto (x₁, x₂) basándose en esta ecuación:",
        "perceptron_eq_desc_p2": "Lo entenderemos todo en un segundo, pero primero revisemos esta ecuación:",
        "perceptron_eq_desc_p3": "Esta ecuación representa la frontera de decisión. Es decir, divide los datos en dos conjuntos. Y si movemos algunas variables, podemos obtener la ecuación de la recta:",
        "perceptron_eq_desc_p4": "Y recuerda la ecuación de la recta.",
        "perceptron_eq_desc_p5": "* La pendiente **m** es **-w₁/w₂**\n\n* El corte en el eje vertical **b** es **-b/w₂**",
        "perceptron_ex":"Puedes jugar con los valores del perceptrón para ver cómo cambia la clasificación",
        "activation_title": "Función de activación",
        "activation_text": "Ahora podemos continuar a la función de activación **f(z)**. Esta función determina a qué clase pertenece cada punto.\n\n Veamos su definición más simple:",
        "activation_text_p2": "Si el valor de **z** es mayor o igual a cero, la función devuelve 1. Si el valor de **z** es menor que cero, la función devuelve -1. Recordemos la ecuación del perceptrón:",
        "activation_text_p3": "Y esto ya lo pudiste ver en el ejemplo anterior. Todo lo que está sobre la frontera de decisión es de una clase, y todo lo que está debajo es de la otra.",
        "exercise_title": "Ejercicios",
        "exercise1_title": "Ejercicio 1",
        "exercise_desc": "Intenta clasificar estos puntos ajustando los pesos y el bias. El objetivo es encontrar una línea que separe los puntos azules de los rojos.",
        "weight1": "Peso w1",
        "weight2": "Peso w2",
        "bias": "Bias (b)",
        "class1": "Clase 1 (y=1)",
        "class_neg1": "Clase -1 (y=-1)",
        "decision_boundary": "Frontera de decisión",
        "graph_title": "Clasificación del Perceptrón y Frontera de Decisión",
        "exercise_plot_title": "Clasificación Práctica",
        "exercise_success": "¡Felicitaciones! Has clasificado correctamente todos los puntos.",
        "exercise_continue": "A veces no todos los puntos pueden ser separados, pero la idea es clasificar correctamente tantos como sea posible.",
        "correct_class1": "Puntos correctamente \n\nclasificados (y=1)",
        "correct_class_neg1": "Puntos correctamente \n\nclasificados (y=-1)",
        "misclassified": "Puntos mal clasificados",
        "exercise2_title": "Ejercicio 2",
        "exercise2_desc": "Ahora vamos a modelar una función lógica. Intenta modelar estas funciones:",
        "exercise2_or": "OR: cuando cualquiera de las entradas es 1, la salida es 1",
        "exercise2_and": "AND: cuando todas las entradas son 1, la salida es 1",
        "exercise2_nand": "NAND: cuando todas las entradas son 1, la salida es -1",
        "exercise2_nor": "NOR: cuando todas las entradas son -1, la salida es 1",
        "exercise2_xor": "XOR: cuando las entradas son diferentes, la salida es 1",
        "exercise2_nor_warning": "¡Ojo! El perceptrón no puede modelar la función NOR, ya que no es linealmente separable.",
        "exercise2_result": "Resultado: estás modelando una función:",
        "limitations_title": "Limitaciones del Perceptrón",
        "limitations_desc": "El perceptrón solo puede aprender patrones Lineales, no puede aprender algo como esto:",
        "limitations_plot_title": "Datos No Linealmente Separables",
        "limitations_text": "En este ejemplo, tenemos dos clases de puntos que forman un patrón circular. Ninguna línea recta puede separar estos puntos correctamente. Esta es la gran limitación del perceptrón que lo mantuvo en el limbo de la historia... hasta la llegada del perceptrón multicapa y el backpropagation.",
        "division_by_zero": "Cuando w₂ = 0, la frontera de decisión se convierte en una línea vertical en x₁ = -b/w₁. La ecuación de la línea no puede escribirse en forma pendiente-ordenada al origen en este caso."
    },
    "line_basic": {
        "title": "Recuerda la recta básica",
        "description_p1": "Recordemos que en un plano cartesiano, podemos graficar una recta siguiendo la siguiente ecuación:",
        "description_p2": "La variable **y** se representa en el eje vertical, mientras que la variable **x**, en el eje horizontal. La pendiente **m** determina la inclinación de la recta, mientras que **b** es el punto donde la recta corta el eje **y**.",
        "exercise_desc":"Puedes jugar con los deslizadores para ver cómo afectan a la recta el valor de la pendiente **m** y el corte **b**",
        "slope": "Pendiente (m)",
        "intercept": "Ordenada al origen (b)",
        "plot_title": "Ecuación de la Recta: y = mx + b"
    },
    "linear_regression": {
        "title": "Regresión Lineal",
        "description_p1": "La regresión lineal es un algoritmo fácil de entender. Consideramos que la relación entre dos variables puede verse como una línea recta.",
        "ex_title": "Ejemplo de un escenario real",
        "ex_desc_p1": "Imagina que queremos predecir la altura de una persona (joven) en función de su edad. Podemos usar la regresión lineal para encontrar una recta que se ajuste a los datos.",
        "ex_desc_p2": "En este caso, la variable independiente **x** es la edad y la variable dependiente **y** es la altura.",
        "ex_interactive_desc": "Puedes jugar con los deslizadores para encontrar una recta que pueda modelar los datos.",
        "ex_plot_title": "Ejemplo de Regresión Lineal usando la altura de una persona",
        "ex_plot_x_label": "Edad (años)",
        "ex_plot_y_label": "Altura (cm)",
        "ex_rmse": "Raíz del Error Cuadrático Medio (RMSE):",
        "ex_hint": "Pista: Intenta minimizar el valor del Error (RMSE)",
        "error_eq_title": "¿Cómo medimos el error?",
        "error_eq_desc_p1": "Para saber si nuestro modelo es bueno, medimos la distancia entre los valores predichos y los valores reales.",
        "error_eq_desc_p2": "Y eso representa el Error Cuadrático Medio (MSE):",
        "error_eq_params": "• Donde **n** es el número de puntos\n\n• **yᵢ** es el valor real de para el punto i\n\n• **ŷᵢ** es el valor predicho para el punto i\n\n• Y cuanto menor sea el MSE, mejor será el ajuste.",
        "error_eq_desc_p3": "Nota que medimos la diferencia entre el valor real **yᵢ** y el valor predicho **ŷᵢ** para cada punto **i**.",
        "error_eq_desc_p4": "Elevar la diferencia al cuadrado tiene dos consecuencias:",
        "error_eq_desc_p5": "1. Los errores grandes son más importantes que los errores pequeños\n\n2. La diferencia siempre es positiva, así que no importa si el modelo predice más o menos que el valor real, el error será positivo.",
        "error_eq_desc_p6": "A este valor se le puede aplicar la raíz cuadrada para obtener el error en las mismas unidades que los valores reales.",
        "slope": "Pendiente (m)",
        "intercept": "Ordenada al origen (b)",
        "best_fit": "Línea de Mejor Ajuste",
        "data_points": "Puntos de Datos",
        "error_lines": "Líneas de Error",
        "show_errors": "Mostrar líneas de error",
        "plot_title": "Línea de Regresión Lineal y Puntos de Datos",
        "explanation_title": "Entendiendo la Regresión Lineal",
        "explanation_text": "• Asumimos que existe una relación lineal entre dos variables.\n\n• La manera más fácil de percibir una relación lineal es graficar los valores en un plano cartesiano.\n\n• Ningún modelo es perfecto, siempre existirá algo de error porque el mundo real no tiene líneas rectas.\n\n• Si quieres utilizar este modelo de forma adecuada, te recomiendo profundizar en estos conceptos: distribución normal, correlación y mínimos cuadrados ordinarios (para los amantes de las matemáticas).\n\n• Finalmente, si quieres implementar este modelo, es tan fácil como usar una librería de python, lo difícil es entender la teoría.",
        "limitations_title": "Limitaciones",
        "limitations_text": "Existen otras relaciones en el mundo real que no siguen una línea recta, por ejemplo:"
    }
} 