{
    "app": {
        "title": "Machine Learning Libre",
        "welcome": "¡Bienvenido! 🎓",
        "description": "Esta aplicación proporciona visualizaciones interactivas para comprender conceptos de machine learning. Utiliza el menú lateral para navegar por las secciones.",
        "available_sections": "Secciones disponibles:",
        "navigation": "Navegación",
        "language": "Idioma"
    },
    "perceptron": {
        "title": "El perceptrón",
        "description": "El perceptrón es un concepto clave, pues las redes neuronales modernas utilizan este elemento como bloque de construcción. \n\n Se trata de una neurona capaz de hacer una clasificación binaria en base a una regresión lineal y una función de activación.",
        "weight1": "Peso w1",
        "weight2": "Peso w2",
        "bias": "Bias (b)",
        "class1": "Clase 1 (y=1)",
        "class_neg1": "Clase -1 (y=-1)",
        "decision_boundary": "Frontera de decisión",
        "graph_title": "Clasificación del Perceptrón y Frontera de Decisión",
        "equations_title": "Ecuaciones Matemáticas",
        "perceptron_eq_title": "Regla de Decisión del Perceptrón:",
        "perceptron_eq_desc": "El perceptrón clasifica un punto (x₁, x₂) basándose en esta ecuación:",
        "comparison_title": "Relación con el Perceptrón:",
        "comparison_text": "¡La frontera de decisión de nuestro perceptrón es una recta! Comparemos ambas ecuaciones:\n\n• Forma estándar: x₂ = mx₁ + b\n• Nuestra frontera: x₂ = -($w_1$/$w_2$)x₁ - (b/$w_2$)\n\nPor lo tanto:\n• La pendiente (m) es -w₁/w₂\n• La ordenada al origen (b) es -b/w₂",
        "boundary_eq_title": "Ecuación de la Frontera de Decisión:",
        "boundary_eq_desc": "La frontera de decisión es donde la salida del perceptrón es igual a cero. Despejando x₂:",
        "explanation_title": "Entendiendo los Parámetros:",
        "explanation_text": "• w₁, w₂: Pesos que determinan la pendiente de la frontera de decisión\n\n• b: Término de bias, determina dónde la línea intersecta el eje x₂ (desplazamiento vertical)\n• La frontera de decisión es la línea que separa las dos clases\n• Los puntos sobre la línea se clasifican como una clase, los puntos debajo como la otra\n• Cuando w₂ = 0, la frontera se convierte en una línea vertical en x₁ = -b/w₁",
        "exercise_title": "Ejercicio Práctico",
        "exercise_desc": "Intenta clasificar estos puntos ajustando los pesos y el bias. El objetivo es encontrar una línea que separe los puntos azules de los rojos.",
        "exercise_plot_title": "Clasificación Práctica",
        "exercise_success": "¡Felicitaciones! Has clasificado correctamente todos los puntos.",
        "exercise_continue": "¡Sigue intentando! Ajusta los pesos y el bias para encontrar una línea que separe las clases.",
        "limitations_title": "Limitaciones del Perceptrón",
        "limitations_desc": "El perceptrón solo puede aprender patrones linealmente separables. Aquí hay un ejemplo de un conjunto de datos no linealmente separable que un perceptrón no puede clasificar correctamente:",
        "limitations_plot_title": "Datos No Linealmente Separables",
        "limitations_text": "En este ejemplo, tenemos dos clases de puntos que forman un patrón circular. Ninguna línea recta (la frontera de decisión del perceptrón) puede separar estos puntos correctamente. Esta es una de las principales limitaciones del modelo perceptrón.",
        "division_by_zero": "Cuando w₂ = 0, la frontera de decisión se convierte en una línea vertical en x₁ = -b/w₁. La ecuación de la línea no puede escribirse en forma pendiente-ordenada al origen en este caso."
    },
    "line_basic": {
        "title": "Recuerda la recta básica",
        "description_p1": "Recordemos que en un plano cartesiano, podemos graficar una recta siguiendo la siguiente ecuación:",
        "description_p2": "La variable **y** se representa en el eje vertical, mientras que la variable **x**, en el eje horizontal. La pendiente **m** determina la inclinación de la recta, mientras que **b** es el punto donde la recta corta el eje **y**.",
        "exercise_desc":"Puedes jugar con los deslizadores para ver cómo afectan a la recta el valor de la pendiente **m** y el corte **b**",
        "slope": "Pendiente (m)",
        "intercept": "Ordenada al origen (b)",
        "plot_title": "Ecuación de la Recta: y = mx + b"
    },
    "linear_regression": {
        "title": "Regresión Lineal",
        "description_p1": "La regresión lineal es un algoritmo fácil de entender. Consideramos que la relación entre dos variables puede verse como una línea recta.",
        "ex_title": "Ejemplo de un escenario real",
        "ex_desc_p1": "Imagina que queremos predecir la altura de una persona (joven) en función de su edad. Podemos usar la regresión lineal para encontrar una recta que se ajuste a los datos.",
        "ex_desc_p2": "En este caso, la variable independiente **x** es la edad y la variable dependiente **y** es la altura.",
        "ex_interactive_desc": "Puedes jugar con los deslizadores para encontrar una recta que pueda modelar los datos.",
        "ex_plot_title": "Ejemplo de Regresión Lineal usando la altura de una persona",
        "ex_plot_x_label": "Edad (años)",
        "ex_plot_y_label": "Altura (cm)",
        "ex_rmse": "Raíz del Error Cuadrático Medio (RMSE):",
        "ex_hint": "Pista: Intenta minimizar el valor del Error (RMSE)",
        "error_eq_title": "¿Cómo medimos el error?",
        "error_eq_desc_p1": "Para saber si nuestro modelo es bueno, medimos la distancia entre los valores predichos y los valores reales.",
        "error_eq_desc_p2": "Y eso representa el Error Cuadrático Medio (MSE):",
        "error_eq_params": "• Donde **n** es el número de puntos\n\n• **yᵢ** es el valor real de para el punto i\n\n• **ŷᵢ** es el valor predicho para el punto i\n\n• Y cuanto menor sea el MSE, mejor será el ajuste.",
        "error_eq_desc_p3": "Nota que medimos la diferencia entre el valor real **yᵢ** y el valor predicho **ŷᵢ** para cada punto **i**.",
        "error_eq_desc_p4": "Elevar la diferencia al cuadrado tiene dos consecuencias:",
        "error_eq_desc_p5": "1. Los errores grandes son más importantes que los errores pequeños\n\n2. La diferencia siempre es positiva, así que no importa si el modelo predice más o menos que el valor real, el error será positivo.",
        "error_eq_desc_p6": "A este valor se le puede aplicar la raíz cuadrada para obtener el error en las mismas unidades que los valores reales.",
        "slope": "Pendiente (m)",
        "intercept": "Ordenada al origen (b)",
        "best_fit": "Línea de Mejor Ajuste",
        "data_points": "Puntos de Datos",
        "error_lines": "Líneas de Error",
        "show_errors": "Mostrar líneas de error",
        "plot_title": "Línea de Regresión Lineal y Puntos de Datos",
        "explanation_title": "Entendiendo la Regresión Lineal",
        "explanation_text": "• Los puntos azules representan nuestros datos\n\n• La línea roja es nuestra línea de predicción (y = mx + b)\n\n• Las líneas grises (opcionales) muestran los errores entre las predicciones y los valores reales\n\n• Un buen ajuste minimiza estos errores\n\n• El valor MSE nos dice qué tan bueno es nuestro ajuste - menor es mejor",
        "exercise_title": "Ejercicio Práctico",
        "exercise_desc": "Intenta encontrar la línea que mejor se ajuste a estos puntos ajustando la pendiente y la ordenada al origen. Observa cómo cambia el Error Cuadrático Medio mientras ajustas la línea.",
        "exercise_plot_title": "Encuentra la Línea de Mejor Ajuste"
    }
} 