{
    "app": {
        "title": "Herramientas Educativas de ML",
        "welcome": "¡Bienvenido a las Herramientas Educativas de ML! 🎓",
        "description": "Esta aplicación proporciona visualizaciones interactivas para comprender conceptos de machine learning. Utiliza el menú lateral para navegar por las diferentes secciones y explorar varias herramientas de ML.",
        "available_sections": "Secciones disponibles:",
        "navigation": "Navegación",
        "language": "Idioma"
    },
    "perceptron": {
        "title": "Visualización del Perceptrón",
        "description": "Modifica los valores de los pesos y el bias para ver cómo cambia la frontera de decisión.",
        "weight1": "Peso w1",
        "weight2": "Peso w2",
        "bias": "Bias (b)",
        "class1": "Clase 1 (y=1)",
        "class_neg1": "Clase -1 (y=-1)",
        "decision_boundary": "Frontera de decisión",
        "graph_title": "Clasificación del Perceptrón y Frontera de Decisión",
        "equations_title": "Ecuaciones Matemáticas",
        "perceptron_eq_title": "Regla de Decisión del Perceptrón:",
        "perceptron_eq_desc": "El perceptrón clasifica un punto (x₁, x₂) basándose en esta ecuación:",
        "line_eq_title": "Ecuación Estándar de la Recta:",
        "line_eq_desc": "Recuerda que cualquier recta puede escribirse en la forma y = mx + b, donde:",
        "line_eq_params": "• m es la pendiente de la recta\n• b es la ordenada al origen (donde la recta cruza el eje y)",
        "comparison_title": "Relación con el Perceptrón:",
        "comparison_text": "¡La frontera de decisión de nuestro perceptrón es una recta! Comparemos ambas ecuaciones:\n\n• Forma estándar: x₂ = mx₁ + b\n• Nuestra frontera: x₂ = -($w_1$/$w_2$)x₁ - (b/$w_2$)\n\nPor lo tanto:\n• La pendiente (m) es -w₁/w₂\n• La ordenada al origen (b) es -b/w₂",
        "boundary_eq_title": "Ecuación de la Frontera de Decisión:",
        "boundary_eq_desc": "La frontera de decisión es donde la salida del perceptrón es igual a cero. Despejando x₂:",
        "explanation_title": "Entendiendo los Parámetros:",
        "explanation_text": "• w₁, w₂: Pesos que determinan la pendiente de la frontera de decisión\n• b: Término de bias, determina dónde la línea intersecta el eje x₂ (desplazamiento vertical)\n• La frontera de decisión es la línea que separa las dos clases\n• Los puntos sobre la línea se clasifican como una clase, los puntos debajo como la otra\n• Cuando w₂ = 0, la frontera se convierte en una línea vertical en x₁ = -b/w₁"
    }
} 