{
    "app": {
        "title": "Machine Learning Gratuito",
        "welcome": "Bem-vindo! 🎓",
        "description": "Esta aplicação fornece visualizações interativas para compreender conceitos de machine learning. Use o menu lateral para navegar pelas seções.",
        "available_sections": "Seções disponíveis:",
        "navigation": "Navegação",
        "language": "Idioma"
    },
    "perceptron": {
        "title": "O Perceptron",
        "description": "O perceptron é um conceito chave, pois as redes neurais modernas usam este elemento como bloco de construção.\n\nÉ uma neurônio capaz de realizar classificação binária baseada em regressão linear e uma função de ativação.",
        "info_linear_regression": "É importante que você já conheça a regressão linear, você pode vê-la neste mesmo projeto.",
        "equations_title": "Equação do Perceptron",
        "perceptron_eq_desc_p1": "O perceptron classifica um ponto (x₁, x₂) baseado nesta equação:",
        "perceptron_eq_desc_p2": "Vamos entender tudo em um segundo, mas primeiro vamos revisar esta equação:",
        "perceptron_eq_desc_p3": "Esta equação representa a fronteira de decisão. Ou seja, divide os dados em dois conjuntos. E se movemos algumas variáveis, podemos obter a equação da reta:",
        "perceptron_eq_desc_p4": "E lembre-se da equação da reta.",
        "perceptron_eq_desc_p5": "* A inclinação **m** é **-w₁/w₂**\n\n* O intercepto y **b** é **-b/w₂**",
        "perceptron_ex": "Você pode brincar com os valores do perceptron para ver como a classificação muda",
        "activation_title": "Função de Ativação",
        "activation_text": "Agora podemos continuar com a função de ativação **f(z)**. Esta função determina a qual classe cada ponto pertence.\n\nVamos ver sua definição mais simples:",
        "activation_text_p2": "Se o valor de **z** é maior ou igual a zero, a função retorna 1. Se o valor de **z** é menor que zero, a função retorna -1. Vamos lembrar a equação do perceptron:",
        "activation_text_p3": "E você já podia ver isso no exemplo anterior. Tudo que está acima da fronteira de decisão é de uma classe, e tudo que está abaixo é da outra.",
        "exercise_title": "Exercícios",
        "exercise1_title": "Exercício 1",
        "exercise_desc": "Tente classificar estes pontos ajustando os pesos e o bias. O objetivo é encontrar uma reta que separe os pontos azuis dos vermelhos.",
        "weight1": "Peso w1",
        "weight2": "Peso w2",
        "bias": "Bias (b)",
        "class1": "Classe 1 (y=1)",
        "class_neg1": "Classe -1 (y=-1)",
        "decision_boundary": "Fronteira de decisão",
        "graph_title": "Classificação do Perceptron e Fronteira de Decisão",
        "exercise_plot_title": "Classificação Prática",
        "exercise_success": "Parabéns! Você classificou corretamente todos os pontos.",
        "exercise_continue": "Às vezes nem todos os pontos podem ser separados, mas a ideia é classificar corretamente o máximo possível.",
        "correct_class1": "Pontos corretamente\n\nclassificados (y=1)",
        "correct_class_neg1": "Pontos corretamente\n\nclassificados (y=-1)",
        "misclassified": "Pontos mal classificados",
        "exercise2_title": "Exercício 2",
        "exercise2_desc": "Agora vamos modelar uma função lógica. Tente modelar estas funções:",
        "exercise2_or": "OR: quando qualquer uma das entradas é 1, a saída é 1",
        "exercise2_and": "AND: quando todas as entradas são 1, a saída é 1",
        "exercise2_nand": "NAND: quando todas as entradas são 1, a saída é -1",
        "exercise2_nor": "NOR: quando todas as entradas são -1, a saída é 1",
        "exercise2_xor": "XOR: quando as entradas são diferentes, a saída é 1",
        "exercise2_nor_warning": "Cuidado! O perceptron não pode modelar a função NOR, pois não é linearmente separável.",
        "exercise2_result": "Resultado: você está modelando uma função:",
        "limitations_title": "Limitações do Perceptron",
        "limitations_desc": "O perceptron só pode aprender padrões Lineares, não pode aprender algo como isso:",
        "limitations_plot_title": "Dados Não Linearmente Separáveis",
        "limitations_text": "Neste exemplo, temos duas classes de pontos que formam um padrão circular. Nenhuma reta pode separar estes pontos corretamente. Esta é a grande limitação do perceptron que o manteve no limbo da história... até a chegada do perceptron multicamada e o backpropagation.",
        "division_by_zero": "Quando w₂ = 0, a fronteira de decisão se torna uma linha vertical em x₁ = -b/w₁. A equação da linha não pode ser escrita na forma inclinação-intercepto neste caso."
    },
    "line_basic": {
        "title": "Lembre-se da reta básica",
        "description_p1": "Lembre-se que em um plano cartesiano, podemos graficar uma reta seguindo a seguinte equação:",
        "description_p2": "A variável **y** é representada no eixo vertical, enquanto a variável **x** está no eixo horizontal. A inclinação **m** determina a inclinação da reta, enquanto **b** é o ponto onde a reta corta o eixo **y**.",
        "exercise_desc": "Você pode brincar com os deslizadores para ver como a inclinação **m** e o intercepto **b** afetam a reta",
        "slope": "Inclinação (m)",
        "intercept": "Intercepto Y (b)",
        "plot_title": "Equação da Reta: y = mx + b"
    },
    "linear_regression": {
        "title": "Regressão Linear",
        "description_p1": "A regressão linear é um algoritmo fácil de entender. Consideramos que a relação entre duas variáveis pode ser vista como uma linha reta.",
        "ex_title": "Exemplo de um cenário real",
        "ex_desc_p1": "Imagine que queremos prever a altura de uma pessoa (jovem) em função da sua idade. Podemos usar regressão linear para encontrar uma reta que se ajuste aos dados.",
        "ex_desc_p2": "Neste caso, a variável independente **x** é a idade e a variável dependente **y** é a altura.",
        "ex_interactive_desc": "Você pode brincar com os deslizadores para encontrar uma reta que possa modelar os dados.",
        "ex_plot_title": "Exemplo de Regressão Linear usando a altura de uma pessoa",
        "ex_plot_x_label": "Idade (anos)",
        "ex_plot_y_label": "Altura (cm)",
        "ex_rmse": "Raiz do Erro Quadrático Médio (RMSE):",
        "ex_hint": "Dica: Tente minimizar o valor do Erro (RMSE)",
        "error_eq_title": "Como medimos o erro?",
        "error_eq_desc_p1": "Para saber se nosso modelo é bom, medimos a distância entre os valores previstos e os valores reais.",
        "error_eq_desc_p2": "E isso representa o Erro Quadrático Médio (MSE):",
        "error_eq_params": "• Onde **n** é o número de pontos\n\n• **yᵢ** é o valor real para o ponto i\n\n• **ŷᵢ** é o valor previsto para o ponto i\n\n• E quanto menor o MSE, melhor o ajuste.",
        "error_eq_desc_p3": "Note que medimos a diferença entre o valor real **yᵢ** e o valor previsto **ŷᵢ** para cada ponto **i**.",
        "error_eq_desc_p4": "Elevar a diferença ao quadrado tem duas consequências:",
        "error_eq_desc_p5": "1. Erros grandes são mais importantes que erros pequenos\n\n2. A diferença é sempre positiva, então não importa se o modelo prevê mais ou menos que o valor real, o erro será positivo.",
        "error_eq_desc_p6": "Este valor pode ser aplicada a raiz quadrada para obter o erro nas mesmas unidades que os valores reais.",
        "slope": "Inclinação (m)",
        "intercept": "Intercepto Y (b)",
        "best_fit": "Linha de Melhor Ajuste",
        "data_points": "Pontos de Dados",
        "error_lines": "Linhas de Erro",
        "show_errors": "Mostrar linhas de erro",
        "plot_title": "Linha de Regressão Linear e Pontos de Dados",
        "explanation_title": "Entendendo a Regressão Linear",
        "explanation_text": "• Assumimos que existe uma relação linear entre duas variáveis.\n\n• A maneira mais fácil de perceber uma relação linear é graficar os valores em um plano cartesiano.\n\n• Nenhum modelo é perfeito, sempre existirá algum erro porque o mundo real não tem linhas retas.\n\n• Se você quiser usar este modelo adequadamente, recomendo aprofundar estes conceitos: distribuição normal, correlação e mínimos quadrados ordinários (para os amantes da matemática).\n\n• Finalmente, se você quiser implementar este modelo, é tão fácil quanto usar uma biblioteca Python, o difícil é entender a teoria.",
        "limitations_title": "Limitações",
        "limitations_text": "Existem outras relações no mundo real que não seguem uma linha reta, por exemplo:"
    }
} 