{
    "app": {
        "title": "Ferramentas Educativas de ML",
        "welcome": "Bem-vindo às Ferramentas Educativas de ML! 🎓",
        "description": "Esta aplicação fornece visualizações interativas para compreender conceitos de machine learning. Utilize o menu lateral para navegar pelas diferentes secções e explorar várias ferramentas de ML.",
        "available_sections": "Secções disponíveis:",
        "navigation": "Navegação",
        "language": "Idioma"
    },
    "perceptron": {
        "title": "Visualização do Perceptron",
        "description": "Modifique os valores dos pesos e do desvio para ver como a fronteira de decisão muda.",
        "weight1": "Peso w1",
        "weight2": "Peso w2",
        "bias": "Desvio (b)",
        "class1": "Classe 1 (y=1)",
        "class_neg1": "Classe -1 (y=-1)",
        "decision_boundary": "Fronteira de decisão",
        "graph_title": "Classificação do Perceptron e Fronteira de Decisão",
        "equations_title": "Equações Matemáticas",
        "perceptron_eq_title": "Regra de Decisão do Perceptron:",
        "perceptron_eq_desc": "O perceptron classifica um ponto (x₁, x₂) com base nesta equação:",
        "line_eq_title": "Equação Padrão da Reta:",
        "line_eq_desc": "Lembre-se que qualquer reta pode ser escrita na forma y = mx + b, onde:",
        "line_eq_params": "• m é o declive da reta\n\n• b é a ordenada na origem (onde a reta interseta o eixo y)",
        "comparison_title": "Relação com o Perceptron:",
        "comparison_text": "A fronteira de decisão do nosso perceptron é uma reta! Vamos comparar ambas as equações:\n\n• Forma padrão: x₂ = mx₁ + b\n\n• Nossa fronteira: x₂ = -($w_1$/$w_2$)x₁ - (b/$w_2$)\n\nPortanto:\n\n• O declive (m) é -w₁/w₂\n\n• A ordenada na origem (b) é -b/w₂",
        "boundary_eq_title": "Equação da Fronteira de Decisão:",
        "boundary_eq_desc": "A fronteira de decisão é onde a saída do perceptron é igual a zero. Resolvendo para x₂:",
        "explanation_title": "Compreensão dos Parâmetros:",
        "explanation_text": "• w₁, w₂: Pesos que determinam o declive da fronteira de decisão\n\n• b: Termo de desvio, determina onde a linha interseta o eixo x₂ (deslocamento vertical)\n\n• A fronteira de decisão é a linha que separa as duas classes\n\n• Os pontos acima da linha são classificados como uma classe, os pontos abaixo como outra\n\n• Quando w₂ = 0, a fronteira torna-se uma linha vertical em x₁ = -b/w₁",
        "line_section_title": "Lembre-se da Reta Básica",
        "line_section_desc": "Vamos explorar a equação básica da reta y = mx + b. Use os deslizadores abaixo para modificar o declive (m) e a ordenada na origem (b) e ver como afetam a reta:",
        "line_slope": "Declive (m)",
        "line_intercept": "Ordenada na origem (b)",
        "line_plot_title": "Equação da Reta: y = mx + b",
        "exercise_title": "Exercício Prático",
        "exercise_desc": "Tente classificar estes pontos ajustando os pesos e o desvio. O objetivo é encontrar uma linha que separe os pontos azuis dos vermelhos.",
        "exercise_plot_title": "Classificação Prática",
        "exercise_success": "Parabéns! Você classificou corretamente todos os pontos!",
        "exercise_continue": "Continue tentando! Ajuste os pesos e o desvio para encontrar uma linha que separe as classes.",
        "limitations_title": "Limitações do Perceptron",
        "limitations_desc": "O perceptron só pode aprender padrões linearmente separáveis. Aqui está um exemplo de um conjunto de dados não linearmente separável que um perceptron não pode classificar corretamente:",
        "limitations_plot_title": "Dados Não Linearmente Separáveis",
        "limitations_text": "Neste exemplo, temos duas classes de pontos que formam um padrão circular. Nenhuma linha reta (a fronteira de decisão do perceptron) pode separar estes pontos corretamente. Esta é uma das principais limitações do modelo perceptron.",
        "division_by_zero": "Quando w₂ = 0, a fronteira de decisão torna-se uma linha vertical em x₁ = -b/w₁. A equação da linha não pode ser escrita na forma declive-ordenada na origem neste caso."
    },
    "linear_regression": {
        "title": "Visualização de Regressão Linear",
        "description": "A regressão linear é um dos algoritmos de machine learning mais fundamentais. Tenta encontrar a melhor linha que se ajuste a um conjunto de pontos minimizando a distância entre os pontos e a linha.\n\nNesta visualização, pode ver como a alteração dos parâmetros da linha afeta o quão bem ela se ajusta aos pontos de dados. O objetivo é encontrar a linha que melhor representa a relação entre x e y.",
        "equations_title": "Equações Matemáticas",
        "line_eq_title": "Equação da Linha:",
        "line_eq_desc": "A linha de regressão linear é definida pela equação:",
        "line_eq_params": "• m é o declive (quão íngreme é a linha)\n\n• b é a ordenada na origem (onde a linha interseta o eixo y)\n\n• Para qualquer entrada x, prevemos y usando esta equação",
        "error_eq_title": "Medição do Erro:",
        "error_eq_desc": "Medimos quão bem a linha se ajusta usando o Erro Quadrático Médio (MSE):",
        "error_eq_params": "• n é o número de pontos\n\n• yᵢ é o valor real de y para o ponto i\n\n• ŷᵢ é o valor previsto de y para o ponto i\n\n• Quanto menor o MSE, melhor é o ajuste",
        "interactive_title": "Visualização Interativa",
        "interactive_desc": "Use os deslizadores para ajustar os parâmetros da linha e ver como afetam o ajuste:",
        "slope": "Declive (m)",
        "intercept": "Ordenada na origem (b)",
        "mse": "Erro Quadrático Médio:",
        "best_fit": "Linha de Melhor Ajuste",
        "data_points": "Pontos de Dados",
        "error_lines": "Linhas de Erro",
        "show_errors": "Mostrar linhas de erro",
        "plot_title": "Linha de Regressão Linear e Pontos de Dados",
        "explanation_title": "Compreendendo a Regressão Linear",
        "explanation_text": "• Os pontos azuis representam os nossos dados\n\n• A linha vermelha é a nossa linha de previsão (y = mx + b)\n\n• As linhas cinzentas (opcionais) mostram os erros entre as previsões e os valores reais\n\n• Um bom ajuste minimiza estes erros\n\n• O valor MSE diz-nos quão bom é o nosso ajuste - menor é melhor",
        "exercise_title": "Exercício Prático",
        "exercise_desc": "Tente encontrar a linha que melhor se ajuste a estes pontos ajustando o declive e a ordenada na origem. Observe como o Erro Quadrático Médio muda enquanto ajusta a linha.",
        "exercise_plot_title": "Encontre a Linha de Melhor Ajuste",
        "exercise_hint": "Dica: Tente minimizar o valor do Erro Quadrático Médio (MSE)"
    }
} 